---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendDropType
source: html/e4f273a6-1f49-8091-43ba-50efda74edc3.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.SingleLineBendDropType Property

Symbol for a 1 line drop

## Syntax (C#)
```csharp
public RiseDropSymbol SingleLineBendDropType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input is not a valid piping rise/drop symbol type.
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration